"use stirct"

var number =10;
var power = -2;

function pow (a, b) {
    var result = 1; // ініціалізація змінної в яку буде записуватись результат
    if (b < 0){ // перевірка якщо взведення в степінь менше нуля, то результат рахується 1/ a ** b
        b *= -1; // значення по модулю, для того щоб цикл корректно відпрацьовував 
        for (let i=0; i < b; i++){
            result *= a;
        }
        result = 1 / result; // степінь менше нуля, то результат рахується 1 / a ** b
    } else { 
    for (let i=0; i < b; i++){ // обрахунок коли степінь більше 0
        result *= a; // взведення в степінь
    }}
    console.log(result); // вивід результату
} 

pow(number, power);
console.log(number ** power); // перевірка що моя функція працює