'number' + 3 + 3; // -> number33 // конкатинація стрінга та двух цифр 3, в результаті отримуємо стрінг 

null + 3; // -> 3 // нічого плюс цифра 3 отримаємо number 3

5 && "qwerty"; // -> qwerty // логічна операція І, вертає qwerty, 5 це true та qwerty це true, оскільки останнє значення true вертаємо його

+'40' + +'2' + "hillel"; // -> 42hillel // конкатинація, зліпить все в один стрінг

'10' - 5 === 6; // -> false // === - строге порівняння, '10' - 5 верне 5 як number, а 5 не дорівнює 6, тому false

true + false; // -> 1 // true = 1, false = 0, тому вертає 1

'4px' - 3; // -> NaN // від стрінга не можливо відняти намбер

'4' - 3; // -> 1 // рядок 4 перетворює в число і далі відбувається віднімання чисел

'6' + 3 ** 0; // -> 61 // конкатинація стрінга до числа, в результаті отримуємо стрінг 61

12 / '6'; // -> 2 // стрінг 6 перетворюється в намбер і відбувається операція ділення

'10' + (5 === 6); // -> 10false // === строге порівння яке верне false і зробить конкатинацію 

null == ''; // -> false // null не дорівнює 0 тому вертає false

3 ** (9 / 3); // -> 27 // спершу операція ділення в лапках, а далі приведення до степені

!!'false' == !!'true'; // -> true // !! - самий швидкий спосіб приведення до булевого значення, тому не пустий рядок це true, 
// true порівняти з true верне true

0 || '0' && 1; // -> 1 // && - має вищий пріорітет вертає true, якщо всі значення true, || - вертає true, якщо одне з двох true, 1 це true,
// тому його і вертаємо

(+null == false) < 1; // -> false // +null верне 0 як number, порівнюємо 0 та false - верне true, true = 1 і 1 не менше 1 тому верне false

false && true || true; // -> true // || - логічне І що має вищий пріорітет пріорітет, вертає true якщо всі значення true, 
// && - логічне АБО, вертає true, якщо хочаб одне значення true

false && (false || true);; // -> false // перша дія в дужках, || - вертає false, якщо хочаб одне false, && - верне false бо два значення false

(+null == false) < 1 ** 5; // -> false // +null верне 0 як number, порівнюємо 0 та false - верне true, 1 в 5 степені = 1, а 1 не менше 1, тому false


